#!/usr/bin/python3
# -*- coding:utf-8 -*-
'''
两个 3 行 3 列的矩阵，实现其对应位置的数据相加，并返回一个新矩阵

X = [[12,7,3],
    [4 ,5,6],
    [7 ,8,9]]

Y = [[5,8,1],
    [6,7,3],
    [4,5,9]]

'''

# 方法1
X = [[12, 7, 3],
     [4, 5, 6],
     [7, 8, 9]]

Y = [[5, 8, 1],
     [6, 7, 3],
     [4, 5, 9]]
z = [[0, 0, 0],
     [0, 0, 0],
     [0, 0, 0]]

for i in range(len(X)):
    for j in range(len(X[0])):
        z[i][j] = X[i][j] + Y[i][j]
for r in z:
    print([r])

# 方法2
import numpy as np

x = np.array([[12, 7, 3],
              [4, 5, 6],
              [7, 8, 9]])
y = np.array([[5, 8, 1],
              [6, 7, 3],
              [4, 5, 9]])

z = x + y
print(z)
